Revit 2027 API
FabricationService.SetServicePaletteExclusions Method
 Sets the service palette exclusions, used by Route and Fill or Design to Fabrication commands, for the current user and session only. This will alter them from the default configuration exclusions to only exclude those palettes passed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool SetServicePaletteExclusions(
	IList<int> excludedPalettes
)
Public Function SetServicePaletteExclusions (
	excludedPalettes As IList(Of Integer)
) As Boolean
public:
bool SetServicePaletteExclusions(
	IList<int>^ excludedPalettes
)
member SetServicePaletteExclusions :
        excludedPalettes : IList<int> -> bool
Parameters
excludedPalettes IList<Int32>
 A list of service palette indexes to be excluded.
Return Value
Boolean
 Returns true if succeeded to set the exclusions to the specified palette(s).
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  Palette indices contains an index that is not larger or equal to 0 and less than PaletteCount.
See Also
Reference
FabricationService Class
Autodesk.Revit.DB Namespace